Tekla.Structures.PluginsInternal.CDelegateSynchronized
CDelegateSynchronized includes all the platform invokable commands and synchronization to AKIT.

Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetPluginBaseDirectory(Tekla.Structures.Internal.dotPluginBaseDirectory_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetPluginName(Tekla.Structures.Internal.dotPluginName_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetPluginId


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportSetPluginResult(System.Int32)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportExecutePluginResult(System.Int32)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportSetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetPluginIntAttributes(Tekla.Structures.Internal.dotPluginAttributesInt_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetPluginDoubleAttributes(Tekla.Structures.Internal.dotPluginAttributesDouble_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetPluginStringAttributes(Tekla.Structures.Internal.dotPluginAttributesString_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.DrawingExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.DrawingExportGetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.DrawingExportSetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.DrawingExportCurrentDefineInputClientId(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.DrawingExportDefineInputCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.DrawingExportPluginRunCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@,Tekla.Structures.Internal.dotConnectionType_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportGetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportSetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.ExportSignalInputEnded


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetPluginBaseDirectory(Tekla.Structures.Internal.dotPluginBaseDirectory_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetPluginName(Tekla.Structures.Internal.dotPluginName_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetPluginId


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportSetPluginResult(System.Int32)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportExecutePluginResult(System.Int32)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportSetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetPluginIntAttributes(Tekla.Structures.Internal.dotPluginAttributesInt_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetPluginDoubleAttributes(Tekla.Structures.Internal.dotPluginAttributesDouble_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetPluginStringAttributes(Tekla.Structures.Internal.dotPluginAttributesString_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotGrExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotGrExportGetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotGrExportSetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotGrExportCurrentDefineInputClientId(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotGrExportDefineInputCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotGrExportPluginRunCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@,Tekla.Structures.Internal.dotConnectionType_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportGetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportSetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateSynchronized.dotExportSignalPluginInputEnded
